
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_primary_ip.v4 will be created
  + resource "netbox_device_primary_ip" "v4" {
      + device_id          = 677
      + id                 = (known after apply)
      + ip_address_id      = (known after apply)
      + ip_address_version = 4
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_device_primary_ip.v6 will be created
  + resource "netbox_device_primary_ip" "v6" {
      + device_id          = 677
      + id                 = (known after apply)
      + ip_address_id      = 946
      + ip_address_version = 6
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.loopback_v4 will be created
  + resource "netbox_ip_address" "loopback_v4" {
      + description           = "Loopback address for R70 (FranzFreunde)"
      + id                    = (known after apply)
      + ip_address            = "45.151.166.21/32"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
      + tenant_id             = 59
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_ip_address.tunnel_endpoint[0] will be created
  + resource "netbox_ip_address" "tunnel_endpoint" {
      + description           = "Tunnel endpoint for R70 (FranzFreunde)"
      + id                    = (known after apply)
      + ip_address            = "92.50.122.234/29"
      + nat_outside_addresses = (known after apply)
      + status                = "active"
      + tags_all              = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.site["CR3"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = 2272
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = 51
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.site["CR4"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = 2271
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = 52
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.site["CR5"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = 2270
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = 50
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_vpn_tunnel_termination.site["CR6"] will be created
  + resource "netbox_vpn_tunnel_termination" "site" {
      + device_interface_id   = 2273
      + id                    = (known after apply)
      + outside_ip_address_id = (known after apply)
      + role                  = "peer"
      + tags_all              = (known after apply)
      + tunnel_id             = 49
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```